IDENTIFICATION DIVISION.
PROGRAM-ID. TICTACTOE.

DATA DIVISION.
LOCAL-STORAGE SECTION.
    01 GAMEBOARD PIC A(9) VALUES "ABCgHgDEF".
    01 PLAYERS PIC A(2) VALUES "XO".
    01 CURRENTPLAYER PIC 9(1) VALUES 1.
        88 ISPLAYER VALUES 1.
    01 LOOPCOUNTER PIC 9(1) VALUES 1.
    01 LOOPCOUNTER2 PIC 9(1).
    01 LOOPCOUNTER3 PIC 9(1).
    01 WINNER PIC S9(1) VALUES -1.
    
PROCEDURE DIVISION.


    ShowBoard.
    DISPLAY GAMEBOARD(1:3)
    DISPLAY GAMEBOARD(4:3)
    DISPLAY GAMEBOARD(7:3)
    GO TO CheckWin.
    
    CheckWin.
    MOVE 1 TO LOOPCOUNTER
    
    IF WINNER < 0
        PERFORM ColumnCheck
    END-IF
    
    IF WINNER < 0
        MOVE 1 TO LOOPCOUNTER
        PERFORM RowCheck
    END-IF
    
    IF WINNER < 0
        MOVE 1 TO LOOPCOUNTER
        PERFORM DiagCheck
    END-IF
        
    
    IF WINNER < 0
        DISPLAY "NO WIN"
        GO TO PlayRound
    ELSE
        DISPLAY WINNER
        DISPLAY LOOPCOUNTER" "LOOPCOUNTER2" "LOOPCOUNTER3
        GO TO Endpoint
    END-IF.
    
    
    ColumnCheck.
        ADD LOOPCOUNTER TO 3 GIVING LOOPCOUNTER2
        ADD LOOPCOUNTER2 TO 3 GIVING LOOPCOUNTER3
        IF GAMEBOARD(LOOPCOUNTER:1) = GAMEBOARD(LOOPCOUNTER2:1) AND GAMEBOARD(LOOPCOUNTER2:1) = GAMEBOARD(LOOPCOUNTER3:1)
            MOVE CURRENTPLAYER TO WINNER
        ELSE
            IF LOOPCOUNTER < 3
                ADD 1 TO LOOPCOUNTER
                GO TO ColumnCheck
            END-IF
        END-IF.
        
    RowCheck.
        ADD LOOPCOUNTER TO 1 GIVING LOOPCOUNTER2
        ADD LOOPCOUNTER2 TO 1 GIVING LOOPCOUNTER3
        IF GAMEBOARD(LOOPCOUNTER:1) = GAMEBOARD(LOOPCOUNTER2:1) AND GAMEBOARD(LOOPCOUNTER2:1) = GAMEBOARD(LOOPCOUNTER3:1)
            MOVE CURRENTPLAYER TO WINNER
        ELSE
            IF LOOPCOUNTER < 9
                ADD 3 TO LOOPCOUNTER
                GO TO RowCheck
            END-IF
        END-IF.
    
    DiagCheck.
        ADD LOOPCOUNTER TO 4 GIVING LOOPCOUNTER2
        ADD LOOPCOUNTER2 TO 4 GIVING LOOPCOUNTER3
        IF GAMEBOARD(LOOPCOUNTER:1) = GAMEBOARD(LOOPCOUNTER2:1) AND GAMEBOARD(LOOPCOUNTER2:1) = GAMEBOARD(LOOPCOUNTER3:1)
            MOVE CURRENTPLAYER TO WINNER
        ELSE
            MOVE 3 TO LOOPCOUNTER
            ADD LOOPCOUNTER TO 2 GIVING LOOPCOUNTER2
            ADD LOOPCOUNTER2 TO 2 GIVING LOOPCOUNTER3 
            IF GAMEBOARD(LOOPCOUNTER:1) = GAMEBOARD(LOOPCOUNTER2:1) AND GAMEBOARD(LOOPCOUNTER2:1) = GAMEBOARD(LOOPCOUNTER3:1)
                MOVE CURRENTPLAYER TO WINNER
            END-IF
        END-IF.
        
    
    
    PlayRound.
    
    EndPoint.
    STOP RUN.
