IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUTA PIC 9(3) IS GLOBAL.
    88 ISENTERED VALUES 7.
01 INPUTB PIC 9(3) IS GLOBAL.
01 OUTPUTA PIC 9(9) IS GLOBAL.

PROCEDURE DIVISION.
ACCEPT INPUTA
IF ISENTERED
    DISPLAY 'Hello, world'
END-IF.
STOP RUN.
