IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATOR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUTA PIC 9(3) IS GLOBAL.
01 INPUTB PIC 9(3) IS GLOBAL.
    88 ISZERO VALUES 0.
01 OPERATOR PIC A(1) IS GLOBAL.
    88 ISVALID VALUES '+' '-' '*' '/' '^'.
    88 ISPLUS VALUES '+'.
    88 ISMINUS VALUES '-'.
    88 ISMULT VALUES '*'.
    88 ISDIV VALUES "/".
    88 ISEXP VALUES "^".
01 OUTPUTA PIC 9(9) IS GLOBAL.

PROCEDURE DIVISION.
    
PROCINPUT.
DISPLAY 'First Value'
ACCEPT INPUTA
DISPLAY 'Operator'
ACCEPT OPERATOR
DISPLAY 'Second Value'
ACCEPT INPUTB
GO TO PROCOUTPUT.

DEADZONE.
DISPLAY 'this never happens'
STOP RUN.

PROCOUTPUT.
IF ISVALID
    DISPLAY INPUTA" "OPERATOR" "INPUTB
    CALL "MATHMAKER"
    DISPLAY OUTPUTA
END-IF.

PROCEND.
STOP RUN.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. MATHMAKER.
    PROCEDURE DIVISION.
    IF ISPLUS
        ADD INPUTA TO INPUTB GIVING OUTPUTA
    ELSE IF ISMINUS
        SUBTRACT INPUTA FROM INPUTB GIVING OUTPUTA
    ELSE IF ISMULT
        MULTIPLY INPUTA BY INPUTB GIVING OUTPUTA
    ELSE IF ISDIV
        DIVIDE INPUTA BY INPUTB GIVING OUTPUTA
    ELSE IF ISEXP
        IF NOT ISZERO
            SUBTRACT 1 FROM INPUTB
            IF NOT ISZERO
                MULTIPLY INPUTA BY INPUTA GIVING OUTPUTA
                GO TO EXP
            ELSE 
                MOVE INPUTA TO OUTPUTA
            END-IF
        ELSE
            MOVE 1 TO OUTPUTA
        END-IF
    END-IF.
    ENDPOINT.
    EXIT PROGRAM.
    
    EXP.
    IF NOT ISZERO
        SUBTRACT 1 FROM INPUTB
        IF NOT ISZERO
            MULTIPLY OUTPUTA BY INPUTA GIVING OUTPUTA
            GO TO EXP
        ELSE
            GO TO ENDPOINT
        END-IF
    END-IF
    EXIT PROGRAM.
    
    END PROGRAM MATHMAKER.

END PROGRAM CALCULATOR.
