IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUTA PIC 9(3) IS GLOBAL.
01 INPUTB PIC 9(3) IS GLOBAL.
01 OPERATOR PIC A(1) IS GLOBAL.
    88 ISVALID VALUES '+' '-' '*' '/' '^'.
01 OUTPUTA PIC 9(9) IS GLOBAL.

PROCEDURE DIVISION.

PROCINPUT.
DISPLAY 'First Value'
ACCEPT INPUTA
DISPLAY 'Operator'
ACCEPT OPERATOR
DISPLAY 'Second Value'
ACCEPT INPUTB
GO TO PROCOUTPUT.

DEADZONE.
DISPLAY 'this never happens'
STOP RUN.

PROCOUTPUT.
IF ISVALID
    DISPLAY INPUTA" "OPERATOR" "INPUTB
END-IF.

PROCEND.
STOP RUN.
